index.org
#+HUGO_BASE_DIR: ./
#+HUGO_SECTION: posts

#+AUTHOR: Tom Purl

#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

** DONE Python Notes                                                 :python:
   CLOSED: [2020-02-12 Wed 10:18]
   :PROPERTIES:
   :EXPORT_FILE_NAME: PythonNotes
   :EXPORT_DATE: 2020-02-11
   :EXPORT_HUGO_MENU: :menu "braindump"
   :EXPORT_HUGO_SECTION: bd
   :END:
   - State "DONE"       from "TODO"       [2020-02-12 Wed 10:18]
*** Toolset
    :PROPERTIES:
    :CUSTOM_ID: toolset
    :END:
  - Emacs
    - [[http://tkf.github.io/emacs-jedi/latest/][jedi.el]]
    - Projectile
    - [[https://www.flycheck.org/en/latest/][flycheck]] (for Emacs)
    - elpy
    - pipenv.el
  - pytest
  - pipenv
  - Multiple terminal windows for the following helpers:
    - ipython
    - git
*** Pipenv
**** Rebuilding a virtual environment
     One of the great things about =pipenv= is that it makes virtual environment
     management relatively brainless. For example, here's how I rebuild a "clean"
     virtual environment:

#+BEGIN_EXAMPLE
# Assuming that you're within the "broken" virtualenv shell
exit
pipenv --rm
pipenv --python <path to python interpreter in your pipfile>
pipenv install
pipenv install --dev
pipenv shell
#+END_EXAMPLE
**** Creating a New Project
     Assuming that your project does not *yet* have a Pipfile, here's how I create
     one:

     #+BEGIN_EXAMPLE
pipenv --python <path to preferred python interpreter>
pipenv install --dev pytest jedi autopep8 yapf flake8
     #+END_EXAMPLE
*** Solving PYTHONPATH Issues
    :PROPERTIES:
    :CUSTOM_ID: solving-pythonpath
    :END:
    I had an issue lately where a Python script in a virtualenv was not
    using the versions of the libraries that were installed in that
    virtualenv. Here's some tips that I learned when debugging the
    issue.
**** Checking The Instance Of Python Being Executed
     :PROPERTIES:
     :CUSTOM_ID: checking-python-instance
     :END:
     First, are you *sure* that you're running the Python executable
     that you think you're running?

     The proper version of Python may not be executed just because
     you're running a script within virtualenv. This is easy to test by
     simply checking the process table. Also, you can try prepending
     your script like this:

     #+BEGIN_SRC sh
       python -m your-script.py
     #+END_SRC

     This was my big mistake the last time I had PYTHONPATH
     issues. After checking the version of Python that was running when
     I executed my script I noticed that it was from a *completely
     different virtualenv*.
**** Checking The Loaded Libraries At Runtime 
     :PROPERTIES:
     :CUSTOM_ID: checking-loaded-libraries-at-runtime
     :END:
     If you'd like to see what libraries are being loaded and from
     where, simply prepend the following to the command that you run to
     execute your Python script:
     #+BEGIN_SRC sh
       python -v -m your-script.py
     #+END_SRC
**** Checking The Library Version In The REPL
     :PROPERTIES:
     :CUSTOM_ID: checking-loaded-libraries-in-repl
     :END:
     Of course, you can also check library versions in the Python REPL
     like so:
     #+BEGIN_SRC sh
       python -c "import robot; print(robot.__version__)"
     #+END_SRC
*** Setting Up A Development Environment On Windows
    :PROPERTIES:
    :CUSTOM_ID: windows-dev
    :END:

  The only tool that changes on Windows is my terminal editor. My
  preference is +Cmder+ Fulent Terminal running a Powershell instance.

  This works pretty well for me but I learned a few lessons when setting
  this up:

**** [[https://github.com/jeffh/sniffer][sniffer]] Isn't Usable on Windows
     :PROPERTIES:
     :CUSTOM_ID: sniffer-on-windows
     :END:

     Sniffer hung for me every time I tried to kill it and it wasn't able to see when
     a file was changed, even after I install =pywin32=.

     I ended up using [[https://docs.pytest.org/en/latest/][py.test]] instead and am very happy with the results.
**** Jedi's A Little Funny
     :PROPERTIES:
     :CUSTOM_ID: funny-jedi
     :END:
  I've had issues starting the jedi server automatically, so I always
  run this command if I'm going to be working on some Python code:

  - =M-x jedi:start-dedicated-server=

*** Emacs Setup
    :PROPERTIES:
    :CUSTOM_ID: emacs
    :END:

    =pipenv= has made things a lot easier to configure Emacs as my Python IDE. Here's
    my config:

    - https://github.com/tompurl/dot-emacs/blob/master/emacs-init.org#python

    As long as I'm using =pipenv= and =pipenv.el= then this configuration is pretty
    darned automatic.
*** TLS Oddities
**** Converting an Encrypted Keypair Into Friendly Formats
     If you want to use client-side TLS with the =requests= library then the easiest
     way to do that is with an unencrypted keypair, with one file for each key. Easy,
     right?

     Welllll I tried doing this 10 different ways with my favorite TLS tool Key Store
     Explorer but just couldn't find the proper format that the =requests= library
     was expecting. Thank goodness I finally found the following:

     - https://github.com/psf/requests/issues/1573#issuecomment-188125157

     Here's my shamelessly copying and pasting it:

***** Generate certificate and private key.
#+BEGIN_EXAMPLE
   // Generate the certificate file.
   openssl pkcs12 -in /path/to/p12cert -nokeys -out certificate.pem
   // Generate private key with passpharse, First enter the password provided with the key and then an arbitrary PEM password //(say: 1234) 
   openssl pkcs12 -in /path/to/p12cert -nocerts -out privkey.pem
#+END_EXAMPLE

   Well, we are not done yet and we need to generate the key that doesn't require the
   PEM password every time it needs to talk to the server.

***** Generate key without passphrase.
 #+BEGIN_EXAMPLE
      // Running this command will prompt for the pem password(1234), on providing which we will obtain the plainkey.pem
      openssl rsa -in privkey.pem -out plainkey.pem
 #+END_EXAMPLE


